[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "../public/Images/book1.jpg",
        "review": "The Great Gatsby is a novel by American author F. Scott Fitzgerald. First published in 1925, it is set in Long Island, New York, be Fitzgerald's magnum opus, The Great Gatsby explores themes of decadence, idealism, resistance to change, social upheaval, and excess, creating a portrait of the Jazz Age or the Roaring Twenties that has been described as a cautionary tale regarding the American Dream. Through its portrayal of society's obsession with wealth and the American Dream, the novel reflects on the emptiness and moral decay beneath the surface of the high society of the 1920s. Fitzgerald uses the characters and setting of the novel to critique the hedonism and materialism of the American upper class, suggesting that the pursuit of wealth and pleasure leads to spiritual emptiness and moral corruption. The Great Gatsby is widely regarded as a masterpiece of American literature and is considered one of the greatest novels ever written.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": [
            "Classic",
            "Romance"
        ],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "../public/Images/book2.jpg",
        "review": "A poignant exploration of racial injustice and moral growth in the American South.timeless masterpiece that grapples with complex black man falsely accused of raping a white woman.\n\nAt its heart, To Kill a Mockingbird is a poignant coming-of-age story that explores the loss of innocence and the harsh realities of prejudice and discrimination. Through Scout’s innocent perspective, we witness the deep-seated racism and injustice that permeate society, as well as the courage and integrity of her father, Atticus Finch, who defends Robinson despite the odds stacked against him.\n\nLee’s narrative is rich in symbolism and allegory, with the mockingbird serving as a powerful motif representing innocence and the senseless destruction of goodness. The novel’s evocative prose and compelling characters, including the enigmatic Boo Radley and the wise and compassionate Atticus, have captivated readers for generations.\n\nTo Kill a Mockingbird remains as relevant today as it was upon its publication in 1960, serving as a stark reminder of the enduring legacy of racism and the importance of empathy and understanding in the face of injustice",
        "totalPages": 324,
        "rating": 4.8,
        "category": "Fiction",
        "tags": [
            "Coming-of-age",
            "Legal drama"
        ],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "../public/Images/book3.jpg",
        "review": "A chilling portrayal of a dystopian society ruled by totalitarianism.F. Scott Fitzgerald’s The Great Gatsby stands as a testamen the eyes of the narrator, Nick Carraway, we are plunged into the glamorous world of East and West Egg, where wealth and excess reign supreme.\n\nAt its core, The Great Gatsby is a cautionary tale about the hollowness of the pursuit of wealth and status, and the disillusionment that accompanies it. Fitzgerald masterfully captures the decadence and moral bankruptcy of the era, juxtaposing the opulence of Gatsby’s parties with the moral decay lurking beneath the surface.\n\nThe characters in the novel are vividly drawn, each representing a different facet of the American Dream. Gatsby, with his relentless pursuit of wealth and status, symbolizes the self-made man striving for success at any cost. Daisy embodies the shallow materialism of the upper class, while Nick serves as the moral compass amidst the chaos.\n\nThrough its lyrical prose and timeless themes of love, longing, and the emptiness of materialism, The Great Gatsby continues to resonate with readers today. It remains a poignant reminder of the fragility of the American Dream and the enduring power of hope",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Fiction",
        "tags": [
            "Dystopian",
            "Political"
        ],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "../public/Images/book4.jpg",
        "review": "An introspective journey of a teenage boy grappling with alienation and identity.Harper Lee’s To Kill a Mockingbird is a social and racial tensions surrounding the trial of Tom Robinson, a black man falsely accused of raping a white woman.\n\nAt its heart, To Kill a Mockingbird is a poignant coming-of-age story that explores the loss of innocence and the harsh realities of prejudice and discrimination. Through Scout’s innocent perspective, we witness the deep-seated racism and injustice that permeate society, as well as the courage and integrity of her father, Atticus Finch, who defends Robinson despite the odds stacked against him.\n\nLee’s narrative is rich in symbolism and allegory, with the mockingbird serving as a powerful motif representing innocence and the senseless destruction of goodness. The novel’s evocative prose and compelling characters, including the enigmatic Boo Radley and the wise and compassionate Atticus, have captivated readers for generations.\n\nTo Kill a Mockingbird remains as relevant today as it was upon its publication in 1960, serving as a stark reminder of the enduring legacy of racism and the importance of empathy and understanding in the face of injustice",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": [
            "Coming-of-age",
            "Existential"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 5,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "../public/Images/book5.jpg",
        "review": "A delightful romantic comedy that explores themes of love, class, and societal expectations.George Orwell’s 1984 is a the ruling party, as he rebels against the oppressive regime and seeks to reclaim his individuality and freedom.\n\nOrwell’s vision of a dystopian future is eerily prescient, with its portrayal of mass surveillance, propaganda, and thought control strikingly reminiscent of modern-day surveillance states. The novel’s iconic phrases, such as 'Big Brother is watching you' and 'War is peace, freedom is slavery, ignorance is strength,' have become ingrained in popular culture, serving as a warning against the dangers of authoritarianism and totalitarianism.\n\nAt its core, 1984 is a powerful meditation on the nature of power and control, exploring the ways in which language can be manipulated to manipulate reality and suppress dissent. Through Winston’s journey of self-discovery and resistance, Orwell forces readers to confront uncomfortable truths about the erosion of freedom and the fragility of truth in a world dominated by propaganda and censorship.\n\n1984 is a timeless classic that continues to resonate with readers across generations, serving as a stark reminder of the dangers of unchecked government power and the importance of safeguarding individual liberty and truth",
        "totalPages": 432,
        "rating": 4.7,
        "category": "Fiction",
        "tags": [
            "Romance",
            "Satire"
        ],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 6,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "../public/Images/book6.jpg",
        "review": "An epic fantasy adventure set in a meticulously crafted world with themes of friendship, courage, and sacrifice.J.D. Salinger’sexpelled from prep school who embarks on a soul-searching journey through the streets of New York City.\n\nAt its heart, The Catcher in the Rye is a story of identity and existential crisis, as Holden grapples with feelings of isolation and disconnection from the superficiality of adult society. Salinger’s narrative is characterized by its distinctive voice, as Holden narrates his experiences in a candid and irreverent tone that resonates with readers of all ages.Throughout the novel, Holden’s encounters with various characters—from his cynical outlook on 'phonies' to his yearning for connection with his younger sister, Phoebe—illuminate the universal struggle for authenticity and belonging. The novel’s timeless themes of adolescence, rebellion, and the search for meaning continue to resonate with readers, making it a classic of American literature.\n\nThe Catcher in the Rye remains as relevant today as when it was first published in 1951, serving as a poignant reminder of",
        "totalPages": 1178,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": [
            "High fantasy",
            "Adventure"
        ],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1954
    }
]